In [9]:
pip install openpyxl

Requirement already satisfied: openpyxl in /Users/annabelcheong/opt/anaconda3/envs/PythonData/lib/python3.6/site-packages (3.0.6)
Requirement already satisfied: et-xmlfile in /Users/annabelcheong/opt/anaconda3/envs/PythonData/lib/python3.6/site-packages (from openpyxl) (1.0.1)
Requirement already satisfied: jdcal in /Users/annabelcheong/opt/anaconda3/envs/PythonData/lib/python3.6/site-packages (from openpyxl) (1.4.1)
Note: you may need to restart the kernel to use updated packages.

In [10]:
import pandas as pd

In [11]:
q32018 = "../housingcsv/2018q3.xlsx"
df1 = pd.read_excel(q32018,engine='openpyxl')
refine1 = df1.drop(['Sales\n3Q 2017', 'Median\n3Q 2017', 'Median\nChange'], axis=1)
refine1= refine1.rename(columns={'Sales\n3Q 2018': 'Sales Q3 2018', 'Median\nQ3 2018': 'Median Q3 2018'})
refine1

               City          Suburb  Sales Q3 2018  Median\n3Q 2018
0          ADELAIDE        ADELAIDE            1.0         960000.0
1          ADELAIDE  NORTH ADELAIDE            9.0        1520000.0
2    ADELAIDE HILLS         ALDGATE            6.0         770000.0
3    ADELAIDE HILLS          ASHTON            1.0         600000.0
4    ADELAIDE HILLS    BASKET RANGE            NaN              NaN
..              ...             ...            ...              ...
474    WEST TORRENS       THEBARTON            4.0         586000.0
475    WEST TORRENS    TORRENSVILLE           12.0         620000.0
476    WEST TORRENS       UNDERDALE            6.0         655000.0
477    WEST TORRENS      WEST BEACH           14.0         904000.0
478    WEST TORRENS   WEST RICHMOND            1.0         490000.0

[479 rows x 4 columns]

In [12]:
q42018 = "../housingcsv/2018q4.xlsx"
df2 = pd.read_excel(q42018,engine='openpyxl')
refine2 = df2.drop(['Sales\n4Q 2017', 'Median\n4Q 2017', 'Median\nChange'], axis=1)
refine2 = refine2.rename(columns={'Sales\n4Q 2018':'Sales Q4 2018', 'Median\n4Q 2018': 'Median Q4 2018'})
refine2

               City          Suburb  Sales Q4 2018  Median Q4 2018
0          ADELAIDE        ADELAIDE            4.0       1660750.0
1          ADELAIDE  NORTH ADELAIDE            9.0       1395000.0
2    ADELAIDE HILLS         ALDGATE            9.0        747500.0
3    ADELAIDE HILLS          ASHTON            NaN             NaN
4    ADELAIDE HILLS    BASKET RANGE            1.0        640000.0
..              ...             ...            ...             ...
474    WEST TORRENS       THEBARTON            5.0        642500.0
475    WEST TORRENS    TORRENSVILLE            7.0        525000.0
476    WEST TORRENS       UNDERDALE            5.0        660000.0
477    WEST TORRENS      WEST BEACH           13.0        751000.0
478    WEST TORRENS   WEST RICHMOND            2.0        500000.0

[479 rows x 4 columns]

In [13]:
q12019 = "../housingcsv/2019q1.xlsx"
df3 = pd.read_excel(q12019,engine='openpyxl')
refine3 = df3.drop(['Sales\n1Q 2018', 'Median\n1Q 2018', 'Median\nChange'], axis=1)
refine3 = refine3.rename(columns={'Sales\n1Q 2019':'Sales Q1 2019', 'Median\n1Q 2019': 'Median Q1 2019'})
refine3

               City          Suburb  Sales Q1 2019  Median Q1 2019
0          ADELAIDE        ADELAIDE            4.0       1002500.0
1          ADELAIDE  NORTH ADELAIDE           10.0        972000.0
2    ADELAIDE HILLS         ALDGATE           16.0        830000.0
3    ADELAIDE HILLS          ASHTON            NaN             NaN
4    ADELAIDE HILLS    BASKET RANGE            NaN             NaN
..              ...             ...            ...             ...
474    WEST TORRENS       THEBARTON            NaN             NaN
475    WEST TORRENS    TORRENSVILLE            7.0        588000.0
476    WEST TORRENS       UNDERDALE            5.0        700000.0
477    WEST TORRENS      WEST BEACH           16.0        852500.0
478    WEST TORRENS   WEST RICHMOND            4.0        510000.0

[479 rows x 4 columns]

In [14]:
q22019 = '../housingcsv/2019q2.xlsx'
df4 = pd.read_excel(q22019,engine='openpyxl')
refine4 = df4.drop(['Sales\n2Q 2018', 'Median\n2Q 2018', 'Median\nChange'], axis=1)
refine4 = refine4.rename(columns={'Sales\n2Q 2019': 'Sales Q2 2019', 'Median\n2Q 2019': 'Median Q2 2019'})
refine4

               City          Suburb  Sales Q2 2019  Median Q2 2019
0          ADELAIDE        ADELAIDE            4.0        677500.0
1          ADELAIDE  NORTH ADELAIDE            6.0       1634250.0
2    ADELAIDE HILLS         ALDGATE           15.0        950000.0
3    ADELAIDE HILLS          ASHTON            NaN             NaN
4    ADELAIDE HILLS    BASKET RANGE            NaN             NaN
..              ...             ...            ...             ...
474    WEST TORRENS       THEBARTON            4.0        607500.0
475    WEST TORRENS    TORRENSVILLE           10.0        690000.0
476    WEST TORRENS       UNDERDALE            4.0        630000.0
477    WEST TORRENS      WEST BEACH           14.0        686000.0
478    WEST TORRENS   WEST RICHMOND            5.0        455000.0

[479 rows x 4 columns]

In [15]:
merged1 = pd.merge(refine1,refine2)
merged2 = pd.merge(refine3,refine4)
final = pd.merge(merged1,merged2)
final = final.dropna(how='any')
final

,City,Suburb,Sales Q3 2018,Median\n3Q 2018,Sales Q4 2018,Median Q4 2018,Sales Q1 2019,Median Q1 2019,Sales Q2 2019,Median Q2 2019
0,ADELAIDE,ADELAIDE,1.0,960000.0,4.0,1660750.0,4.0,1002500.0,4.0,677500.0
1,ADELAIDE,NORTH ADELAIDE,9.0,1520000.0,9.0,1395000.0,10.0,972000.0,6.0,1634250.0
2,ADELAIDE HILLS,ALDGATE,6.0,770000.0,9.0,747500.0,16.0,830000.0,15.0,950000.0
5,ADELAIDE HILLS,BELAIR,9.0,737000.0,19.0,670000.0,15.0,657500.0,17.0,541250.0
7,ADELAIDE HILLS,BRIDGEWATER,19.0,535000.0,15.0,470000.0,14.0,568750.0,20.0,483500.0
...,...,...,...,...,...,...,...,...,...,...
473,WEST TORRENS,RICHMOND,10.0,550000.0,12.0,580000.0,7.0,487000.0,9.0,574500.0
475,WEST TORRENS,TORRENSVILLE,12.0,620000.0,7.0,525000.0,7.0,588000.0,10.0,690000.0
476,WEST TORRENS,UNDERDALE,6.0,655000.0,5.0,660000.0,5.0,700000.0,4.0,630000.0
477,WEST TORRENS,WEST BEACH,14.0,904000.0,13.0,751000.0,16.0,852500.0,14.0,686000.0
478,WEST TORRENS,WEST RICHMOND,1.0,490000.0,2.0,500000.0,4.0,510000.0,5.0,455000.0

In [16]:
final.to_csv('y18_19_house.csv')